# Personal homebrew package list
# Install using `brew bundle --global`
#
# To view what things are installed in homebrew

## Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/binary'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/x11'
tap 'homebrew/dev-tools' # For brew pry

tap 'chef/chefops-tools'
tap 'chef/chef'
tap 'habitat-sh/habitat'
tap 'chef/okta_aws'

# For X stuff
cask 'xquartz'

## Normal homebrew stuff
# Essentials
brew 'awscli'
brew 'git'
brew 'jq'
brew 'mtr'
brew 'sqlite'
brew 'stow'
brew 'the_silver_searcher'
brew 'vim'

# Shell helpers
brew 'bash'
brew 'bash-completion'
brew 'direnv'
brew 'autojump'
brew 'fzf'

# Nice to haves
brew 'a2ps'
brew 'awslogs'
brew 'cfssl'
brew 'cli53'
brew 'colordiff'
brew 'cookiecutter'
brew 'dfu-programmer' # For programming the mechanical keyboard
brew 'feh'
brew 'go-jira'
brew 'gomplate'
brew 'graphicsmagick'
brew 'graphviz'
brew 'heroku'
brew 'hub'
brew 'kops'
brew 'kubernetes-cli'
brew 'ldapvi'
brew 'ledger'
brew 'leiningen'
brew 'mackup'
brew 'mitmproxy'
brew 'mpv'
brew 'ngrep'
brew 'nmap'
brew 'openvpn'
brew 'pgbadger'
brew 'postgresql'
brew 'pssh'
brew 'pwgen'
brew 'redis'
brew 'shellcheck'
brew 'sipcalc'
brew 'ssh-copy-id'
brew 'switchaudio-osx'
brew 'sysdig'
brew 'telnet'
brew 'tarsnap'
brew 'tmux'
brew 'wdiff'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'xz', args: ['universal']

# Programming languages
brew 'go'
brew 'go-bindata'
brew 'node'
brew 'python'
brew 'python3'
brew 'rust'

# jmespath.org - jq alternative
tap 'jmespath/jmespath'
brew 'jmespath/jmespath/jp'

# Hashicorp
brew 'consul'
brew 'packer'
#brew 'terraform'
cask 'vagrant'
brew 'vault'
# Not exactly hashicorp, but related
brew 'tfenv'

## Chef Stuff
cask 'chef/chef/chef-workstation'
brew 'okta_aws'
brew 'hab'

## Mac apps (casks)
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'arduino'
cask 'audio-hijack'
cask 'bartender'
cask 'chicken' # VNC - needed for some vnc servers
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'docker'
cask 'dungeon-crawl-stone-soup-tiles'
cask 'gas-mask'
cask 'gimp'
cask 'gmvault' # Gmail backup
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'linein'
cask 'logitech-myharmony'
cask 'minikube'
cask 'openscad'
cask 'skype'
cask 'spotify'
cask 'steam'
cask 'sonic-pi'
cask 'ubersicht'
cask 'virtualbox'
cask 'viscosity'
cask 'vlc'
cask 'wireshark'
cask 'zoomus'

## Mac app store apps
brew 'mas' # The CLI to manage App Store things

# Apple stuff
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'iPhoto', id: 408981381
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Xcode', id: 497799835

# Paid stuff
mas 'GIF Brewery 3', id: 1081413713
mas 'Marked', id: 448925439
mas 'Shush', id: 496437906
mas 'Tweetbot', id: 557168941
mas 'MindNode', id: 1289197285
mas 'Bear', id: 1091189122

# Other app store apps
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Slack', id: 803453959
mas 'Monosnap', id: 540348655
mas 'LastPass', id: 926036361
