{
  "plugins": {
    "ansible-vim": {
      "src": "https://github.com/pearofducks/ansible-vim"
    },
    "copilot.vim": {
      "src": "https://github.com/github/copilot.vim"
    },
    "fennel.vim": {
      "src": "https://github.com/bakpakin/fennel.vim"
    },
    "fzy-lua-native": {
      "src": "https://github.com/romgrk/fzy-lua-native"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "jq.vim": {
      "src": "https://github.com/vito-c/jq.vim"
    },
    "lsp_signature.nvim": {
      "src": "https://github.com/ray-x/lsp_signature.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim"
    },
    "none-ls-shellcheck.nvim": {
      "src": "https://github.com/gbprod/none-ls-shellcheck.nvim"
    },
    "none-ls.nvim": {
      "src": "https://github.com/nvimtools/none-ls.nvim"
    },
    "nvcode-color-schemes.vim": {
      "src": "https://github.com/ChristianChiarulli/nvcode-color-schemes.vim"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "open-browser.vim": {
      "src": "https://github.com/tyru/open-browser.vim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "taskpaper.vim": {
      "src": "https://github.com/davidoc/taskpaper.vim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": ">=0.0.0"
    },
    "undotree": {
      "src": "https://github.com/mbbill/undotree"
    },
    "vim-ledger": {
      "src": "https://github.com/ledger/vim-ledger"
    },
    "vim-minotl": {
      "src": "https://github.com/mivok/vim-minotl"
    },
    "vim-openscad": {
      "src": "https://github.com/sirtaj/vim-openscad"
    },
    "vim-terraform": {
      "src": "https://github.com/hashivim/vim-terraform"
    },
    "vim-tintin": {
      "src": "https://github.com/LokiChaos/vim-tintin"
    },
    "wilder.nvim": {
      "src": "https://github.com/gelguy/wilder.nvim"
    }
  }
}
